In [1]:
import pandas as pd

In [2]:
help(pd.merge)

Help on function merge in module pandas.core.reshape.merge:

merge(left, right, how: str = 'inner', on=None, left_on=None, right_on=None, left_index: bool = False, right_index: bool = False, sort: bool = False, suffixes=('_x', '_y'), copy: bool = True, indicator: bool = False, validate=None) -> 'DataFrame'
    Merge DataFrame or named Series objects with a database-style join.

    The join is done on columns or indexes. If joining columns on
    columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
    on indexes or indexes on a column or columns, the index will be passed on.
    When performing a cross merge, no column specifications to merge on are
    allowed.

    Parameters
    ----------
    left : DataFrame
    right : DataFrame or named Series
        Object to merge with.
    how : {'left', 'right', 'outer', 'inner', 'cross'}, default 'inner'
        Type of merge to be performed.

        * left: use only keys from left frame, similar to a SQL left outer join;
          preserve key order.
        * right: use only keys from right frame, similar to a SQL right outer join;
          preserve key order.
        * outer: use union of keys from both frames, similar to a SQL full outer
          join; sort keys lexicographically.
        * inner: use intersection of keys from both frames, similar to a SQL inner
          join; preserve the order of the left keys.
        * cross: creates the cartesian product from both frames, preserves the order
          of the left keys.

          .. versionadded:: 1.2.0

    on : label or list
        Column or index level names to join on. These must be found in both
        DataFrames. If `on` is None and not merging on indexes then this defaults
        to the intersection of the columns in both DataFrames.
    left_on : label or list, or array-like
        Column or index level names to join on in the left DataFrame. Can also
        be an array or list of arrays of the length of the left DataFrame.
        These arrays are treated as if they are columns.
    right_on : label or list, or array-like
        Column or index level names to join on in the right DataFrame. Can also
        be an array or list of arrays of the length of the right DataFrame.
        These arrays are treated as if they are columns.
    left_index : bool, default False
        Use the index from the left DataFrame as the join key(s). If it is a
        MultiIndex, the number of keys in the other DataFrame (either the index
        or a number of columns) must match the number of levels.
    right_index : bool, default False
        Use the index from the right DataFrame as the join key. Same caveats as
        left_index.
    sort : bool, default False
        Sort the join keys lexicographically in the result DataFrame. If False,
        the order of the join keys depends on the join type (how keyword).
    suffixes : list-like, default is ("_x", "_y")
        A length-2 sequence where each element is optionally a string
        indicating the suffix to add to overlapping column names in
        `left` and `right` respectively. Pass a value of `None` instead
        of a string to indicate that the column name from `left` or
        `right` should be left as-is, with no suffix. At least one of the
        values must not be None.
    copy : bool, default True
        If False, avoid copy if possible.
    indicator : bool or str, default False
        If True, adds a column to the output DataFrame called "_merge" with
        information on the source of each row. The column can be given a different
        name by providing a string argument. The column will have a Categorical
        type with the value of "left_only" for observations whose merge key only
        appears in the left DataFrame, "right_only" for observations
        whose merge key only appears in the right DataFrame, and "both"
        if the observation's merge key is found in both DataFrames.

    validate : str, optional
        If specified, checks if merge is of specified type.

        * "one_to_one" or "1:1": check if merge keys are unique in both
          left and right datasets.
        * "one_to_many" or "1:m": check if merge keys are unique in left
          dataset.
        * "many_to_one" or "m:1": check if merge keys are unique in right
          dataset.
        * "many_to_many" or "m:m": allowed, but does not result in checks.

    Returns
    -------
    DataFrame
        A DataFrame of the two merged objects.

    See Also
    --------
    merge_ordered : Merge with optional filling/interpolation.
    merge_asof : Merge on nearest keys.
    DataFrame.join : Similar method using indices.

    Notes
    -----
    Support for specifying index levels as the `on`, `left_on`, and
    `right_on` parameters was added in version 0.23.0
    Support for merging named Series objects was added in version 0.24.0

    Examples
    --------
    >>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [1, 2, 3, 5]})
    >>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [5, 6, 7, 8]})
    >>> df1
        lkey value
    0   foo      1
    1   bar      2
    2   baz      3
    3   foo      5
    >>> df2
        rkey value
    0   foo      5
    1   bar      6
    2   baz      7
    3   foo      8

    Merge df1 and df2 on the lkey and rkey columns. The value columns have
    the default suffixes, _x and _y, appended.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey')
      lkey  value_x rkey  value_y
    0  foo        1  foo        5
    1  foo        1  foo        8
    2  foo        5  foo        5
    3  foo        5  foo        8
    4  bar        2  bar        6
    5  baz        3  baz        7

    Merge DataFrames df1 and df2 with specified left and right suffixes
    appended to any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey',
    ...           suffixes=('_left', '_right'))
      lkey  value_left rkey  value_right
    0  foo           1  foo            5
    1  foo           1  foo            8
    2  foo           5  foo            5
    3  foo           5  foo            8
    4  bar           2  bar            6
    5  baz           3  baz            7

    Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
    any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
    Traceback (most recent call last):
    ...
    ValueError: columns overlap but no suffix specified:
        Index(['value'], dtype='object')

    >>> df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
    >>> df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
    >>> df1
          a  b
    0   foo  1
    1   bar  2
    >>> df2
          a  c
    0   foo  3
    1   baz  4

    >>> df1.merge(df2, how='inner', on='a')
          a  b  c
    0   foo  1  3

    >>> df1.merge(df2, how='left', on='a')
          a  b  c
    0   foo  1  3.0
    1   bar  2  NaN

    >>> df1 = pd.DataFrame({'left': ['foo', 'bar']})
    >>> df2 = pd.DataFrame({'right': [7, 8]})
    >>> df1
        left
    0   foo
    1   bar
    >>> df2
        right
    0   7
    1   8

    >>> df1.merge(df2, how='cross')
       left  right
    0   foo      7
    1   foo      8
    2   bar      7
    3   bar      8

Parameters
    ----------
    left : DataFrame
    right : DataFrame or named Series
        Object to merge with.
    how : {'left', 'right', 'outer', 'inner', 'cross'}, default 'inner'
        Type of merge to be performed.
    
        * left: use only keys from left frame, similar to a SQL left outer join;
          preserve key order.
        * right: use only keys from right frame, similar to a SQL right outer join;
          preserve key order.
        * outer: use union of keys from both frames, similar to a SQL full outer
          join; sort keys lexicographically.
        * inner: use intersection of keys from both frames, similar to a SQL inner
          join; preserve the order of the left keys.
        * cross: creates the cartesian product from both frames, preserves the order
          of the left keys.

## Type of Merge Operations:

1.) Inner Join   
2.) Left Join   | Left Outer Join  
3.) Right Join  | Right Outer Join  
4.) Outer Join | Full Outer Join  
5.) Cross Join

In [3]:
# Inner Join:

In [6]:
order = pd.read_excel("Sales Order.xlsx",sheet_name="Orders")
returns = pd.read_excel("Sales Order.xlsx",sheet_name="Returns")

In [7]:
print(order.shape, returns.shape)

(5000, 7) (2000, 5)

In [8]:
order.head()

,Order ID,Unique ID,Customer,City,Quantity,Price,Total Sale Amount
0,NJ-2016-152156,NJ-2016-TT-107,Raymond Young,Troy,6,12.42,74.52
1,NJ-2016-138688,NJ-2016-PC-944,Helen Dean,Westfield,7,12.42,86.94
2,WA-2015-108966,WA-2015-TQ-107,Shirley Chavez,Seattle,2,16.32,32.64
3,NJ-2014-115812,NJ-2014-ZI-111,Brian Ryan,Westfield,1,12.42,12.42
4,NJ-2017-114412,NJ-2017-JR-537,Benjamin Willis,Westfield,3,17.83,53.49

In [9]:
returns.head()

         Order ID        Unique ID         Customer       City       State
0  NJ-2016-273214  NJ-ZKDFQ-821902    Raymond Young       Troy    New York
1  NJ-2016-271456  NJ-UTHRK-895117       Helen Dean  Westfield  New Jersey
2  WA-2015-451988  WA-ETBAQ-135442   Shirley Chavez    Seattle  Washington
3  NJ-2014-352961  NJ-EHGXM-601830       Brian Ryan  Westfield  New Jersey
4  NJ-2017-213231  NJ-CJFQS-287500  Benjamin Willis  Westfield  New Jersey

In [10]:
inner_join = pd.merge(left=order, right=returns, left_on = "Order ID", right_on="Order ID")

In [11]:
inner_join.shape

(89, 11)

In [12]:
inner_join = pd.merge(left=order, right=returns, on = "Order ID")

In [13]:
inner_join.shape

(89, 11)

In [14]:
inner_join = pd.merge(left=order, right=returns,on = "Order ID", how = "inner")

In [15]:
inner_join.head()

,Order ID,Unique ID_x,Customer_x,City_x,Quantity,Price,Total Sale Amount,Unique ID_y,Customer_y,City_y,State
0,WA-2016-117590,NJ-TEXWY-11752,Judy Sanchez,Seattle,7,53.35,373.45,NJ-TEXWY-11752,Judy Sanchez,Seattle,Washington
1,WA-2015-117415,NJ-QDWAV-21173,Harold Hunter,Seattle,4,12.42,49.68,NJ-QDWAV-21173,Harold Hunter,Seattle,Washington
2,MA-2017-120999,WA-JJEKO-18817,Lori Shaw,Lowell,7,16.32,114.24,WA-JJEKO-18817,Lori Shaw,Lowell,Massachusetts
3,NJ-2016-101343,NJ-MJQGV-20387,Sandra Hicks,Troy,1,53.35,53.35,NJ-MJQGV-20387,Sandra Hicks,Troy,New York
4,MA-2017-139619,NJ-SDISO-30581,Roger Gomez,Lowell,7,16.32,114.24,NJ-SDISO-30581,Roger Gomez,Lowell,Massachusetts

In [16]:
inner_join = pd.merge(left=order, right=returns,on = "Order ID", how = "inner", 
                      suffixes=("_OrderT","_ReturnsT"))

In [17]:
inner_join.head()

,Order ID,Unique ID_OrderT,Customer_OrderT,City_OrderT,Quantity,Price,Total Sale Amount,Unique ID_ReturnsT,Customer_ReturnsT,City_ReturnsT,State
0,WA-2016-117590,NJ-TEXWY-11752,Judy Sanchez,Seattle,7,53.35,373.45,NJ-TEXWY-11752,Judy Sanchez,Seattle,Washington
1,WA-2015-117415,NJ-QDWAV-21173,Harold Hunter,Seattle,4,12.42,49.68,NJ-QDWAV-21173,Harold Hunter,Seattle,Washington
2,MA-2017-120999,WA-JJEKO-18817,Lori Shaw,Lowell,7,16.32,114.24,WA-JJEKO-18817,Lori Shaw,Lowell,Massachusetts
3,NJ-2016-101343,NJ-MJQGV-20387,Sandra Hicks,Troy,1,53.35,53.35,NJ-MJQGV-20387,Sandra Hicks,Troy,New York
4,MA-2017-139619,NJ-SDISO-30581,Roger Gomez,Lowell,7,16.32,114.24,NJ-SDISO-30581,Roger Gomez,Lowell,Massachusetts

In [18]:
order.head(1)

,Order ID,Unique ID,Customer,City,Quantity,Price,Total Sale Amount
0,NJ-2016-152156,NJ-2016-TT-107,Raymond Young,Troy,6,12.42,74.52

In [19]:
returns.head(1)

         Order ID        Unique ID       Customer  City     State
0  NJ-2016-273214  NJ-ZKDFQ-821902  Raymond Young  Troy  New York

In [20]:
order['Order ID'].isin(returns["Order ID"]).value_counts()

False    4911
True       89
Name: Order ID, dtype: int64

In [22]:
returns.columns

Index(['Order ID', 'Unique ID', 'Customer', 'City', 'State'], dtype='object')

In [23]:
returns.rename(columns = {"Order ID":"Invoice ID"},inplace = True)

In [24]:
returns.columns

Index(['Invoice ID', 'Unique ID', 'Customer', 'City', 'State'], dtype='object')

In [25]:
inner_join = pd.merge(order, returns,left_on = "Order ID", right_on="Invoice ID")

In [26]:
inner_join.shape

(89, 12)

In [27]:
order.shape

(5000, 7)

In [28]:
returns.shape

(2000, 5)

In [29]:
inner_join.head()

,Order ID,Unique ID_x,Customer_x,City_x,Quantity,Price,Total Sale Amount,Invoice ID,Unique ID_y,Customer_y,City_y,State
0,WA-2016-117590,NJ-TEXWY-11752,Judy Sanchez,Seattle,7,53.35,373.45,WA-2016-117590,NJ-TEXWY-11752,Judy Sanchez,Seattle,Washington
1,WA-2015-117415,NJ-QDWAV-21173,Harold Hunter,Seattle,4,12.42,49.68,WA-2015-117415,NJ-QDWAV-21173,Harold Hunter,Seattle,Washington
2,MA-2017-120999,WA-JJEKO-18817,Lori Shaw,Lowell,7,16.32,114.24,MA-2017-120999,WA-JJEKO-18817,Lori Shaw,Lowell,Massachusetts
3,NJ-2016-101343,NJ-MJQGV-20387,Sandra Hicks,Troy,1,53.35,53.35,NJ-2016-101343,NJ-MJQGV-20387,Sandra Hicks,Troy,New York
4,MA-2017-139619,NJ-SDISO-30581,Roger Gomez,Lowell,7,16.32,114.24,MA-2017-139619,NJ-SDISO-30581,Roger Gomez,Lowell,Massachusetts

In [30]:
inner_join = pd.merge(order,returns,left_on = ["Order ID","City"], right_on=["Invoice ID","City"])

In [31]:
inner_join.shape

(89, 11)

In [32]:
inner_join = pd.merge(order,returns,left_on = ["Order ID","City"], 
                      right_on=["Invoice ID","City"], indicator=True)

In [33]:
inner_join.head()

,Order ID,Unique ID_x,Customer_x,City,Quantity,Price,Total Sale Amount,Invoice ID,Unique ID_y,Customer_y,State,_merge
0,WA-2016-117590,NJ-TEXWY-11752,Judy Sanchez,Seattle,7,53.35,373.45,WA-2016-117590,NJ-TEXWY-11752,Judy Sanchez,Washington,both
1,WA-2015-117415,NJ-QDWAV-21173,Harold Hunter,Seattle,4,12.42,49.68,WA-2015-117415,NJ-QDWAV-21173,Harold Hunter,Washington,both
2,MA-2017-120999,WA-JJEKO-18817,Lori Shaw,Lowell,7,16.32,114.24,MA-2017-120999,WA-JJEKO-18817,Lori Shaw,Massachusetts,both
3,NJ-2016-101343,NJ-MJQGV-20387,Sandra Hicks,Troy,1,53.35,53.35,NJ-2016-101343,NJ-MJQGV-20387,Sandra Hicks,New York,both
4,MA-2017-139619,NJ-SDISO-30581,Roger Gomez,Lowell,7,16.32,114.24,MA-2017-139619,NJ-SDISO-30581,Roger Gomez,Massachusetts,both

In [34]:
inner_join._merge.value_counts()

both          89
left_only      0
right_only     0
Name: _merge, dtype: int64

### Left Join:

In [35]:
returns.rename(columns = {"Invoice ID":"Order ID"},inplace=True)

In [36]:
leftJoin = pd.merge(left=order, right = returns, on = "Order ID",how = "left", indicator=True)

In [37]:
order.shape

(5000, 7)

In [38]:
returns.shape

(2000, 5)

In [39]:
leftJoin.shape

(5000, 12)

In [40]:
leftJoin._merge.value_counts()

left_only     4911
both            89
right_only       0
Name: _merge, dtype: int64

In [41]:
# Right Join:

In [42]:
rightjoin = pd.merge(order,returns, on = "Order ID", how = "right", indicator=True)

In [44]:
rightjoin._merge.value_counts()

right_only    1911
both            89
left_only        0
Name: _merge, dtype: int64

In [45]:
returns.shape

(2000, 5)

In [46]:
# Full Join:

In [47]:
# Full Join --> (A + B) - (A intersection B)

In [48]:
fulljoin = pd.merge(order,returns, on = "Order ID", how = "outer",indicator=True)

In [49]:
print(order.shape,returns.shape)

(5000, 7) (2000, 5)

In [50]:
fulljoin.shape

(6911, 12)

In [51]:
fulljoin._merge.value_counts()

left_only     4911
right_only    1911
both            89
Name: _merge, dtype: int64

In [52]:
5000 + 2000

7000

In [53]:
7000 - 89

6911

In [54]:
fulljoin[fulljoin._merge.isin(["right_only","both"])].shape

(2000, 12)

In [55]:
fulljoin[fulljoin._merge.isin(["left_only","both"])].shape

(5000, 12)

In [56]:
fulljoin[fulljoin._merge.isin(["left_only","both"])].head()

,Order ID,Unique ID_x,Customer_x,City_x,Quantity,Price,Total Sale Amount,Unique ID_y,Customer_y,City_y,State,_merge
0,NJ-2016-152156,NJ-2016-TT-107,Raymond Young,Troy,6.0,12.42,74.52,NaN,NaN,NaN,NaN,left_only
1,NJ-2016-138688,NJ-2016-PC-944,Helen Dean,Westfield,7.0,12.42,86.94,NaN,NaN,NaN,NaN,left_only
2,WA-2015-108966,WA-2015-TQ-107,Shirley Chavez,Seattle,2.0,16.32,32.64,NaN,NaN,NaN,NaN,left_only
3,NJ-2014-115812,NJ-2014-ZI-111,Brian Ryan,Westfield,1.0,12.42,12.42,NaN,NaN,NaN,NaN,left_only
4,NJ-2017-114412,NJ-2017-JR-537,Benjamin Willis,Westfield,3.0,17.83,53.49,NaN,NaN,NaN,NaN,left_only

In [57]:
fulljoin[fulljoin._merge.isin(["both"])].head()

,Order ID,Unique ID_x,Customer_x,City_x,Quantity,Price,Total Sale Amount,Unique ID_y,Customer_y,City_y,State,_merge
16,WA-2016-117590,NJ-TEXWY-11752,Judy Sanchez,Seattle,7.0,53.35,373.45,NJ-TEXWY-11752,Judy Sanchez,Seattle,Washington,both
17,WA-2015-117415,NJ-QDWAV-21173,Harold Hunter,Seattle,4.0,12.42,49.68,NJ-QDWAV-21173,Harold Hunter,Seattle,Washington,both
18,MA-2017-120999,WA-JJEKO-18817,Lori Shaw,Lowell,7.0,16.32,114.24,WA-JJEKO-18817,Lori Shaw,Lowell,Massachusetts,both
19,NJ-2016-101343,NJ-MJQGV-20387,Sandra Hicks,Troy,1.0,53.35,53.35,NJ-MJQGV-20387,Sandra Hicks,Troy,New York,both
20,MA-2017-139619,NJ-SDISO-30581,Roger Gomez,Lowell,7.0,16.32,114.24,NJ-SDISO-30581,Roger Gomez,Lowell,Massachusetts,both

In [58]:
fulljoin[fulljoin._merge.isin(["both"])].shape

(89, 12)

In [59]:
# Cross Join

In [60]:
crossjoin = pd.merge(order[:5], returns[:5], how = "cross", indicator=True)

In [61]:
crossjoin.shape

(25, 13)

In [62]:
pd.merge(order[:5], returns[:5], on = "Order ID", how = "cross", indicator=True)

MergeError: Can not pass on, right_on, left_on or set right_index=True or left_index=True

In [63]:
crossjoin._merge.value_counts()

both          25
left_only      0
right_only     0
Name: _merge, dtype: int64

In [65]:
df1 = pd.DataFrame({"left":["A","B"]})
df2 = pd.DataFrame({"right":[5,8]})

In [66]:
df1

  left
0    A
1    B

In [67]:
df2

   right
0      5
1      8

In [68]:
pd.merge(df1, df2, how = "cross")

  left  right
0    A      5
1    A      8
2    B      5
3    B      8

In [69]:
emp = pd.read_clipboard()

In [70]:
emp.head()

   EmpID   Name  Age  Experience
0    111   Amit   31           5
1    222  Jeena   31           2
2    333   John   36           4
3    444  Vivek   35           9
4    555   Luke   40           6

In [71]:
emp.set_index("EmpID",inplace=True)

In [72]:
emp.head()

        Name  Age  Experience
EmpID
111     Amit   31           5
222    Jeena   31           2
333     John   36           4
444    Vivek   35           9
555     Luke   40           6

In [73]:
salary = pd.read_clipboard()

In [74]:
salary.head()

   EmpID  Salary  Increment
0    111   76804       8448
1    222   70350       8442
2    333   86907       9559
3    444   77576       7757
4    555   59766       5976

In [75]:
salary.set_index("EmpID", inplace=True)

In [76]:
salary.head()

       Salary  Increment
EmpID
111     76804       8448
222     70350       8442
333     86907       9559
444     77576       7757
555     59766       5976

In [77]:
pd.merge(emp, salary, left_index=True, right_index=True)

         Name  Age  Experience  Salary  Increment
EmpID
111      Amit   31           5   76804       8448
222     Jeena   31           2   70350       8442
333      John   36           4   86907       9559
444     Vivek   35           9   77576       7757
555      Luke   40           6   59766       5976
666    Harris   36           1   55001       4950
777    Warner   32           3   55673       5010
888    Dravid   34           1   54940       5494
999     Rahul   37           8   78865       7886

In [78]:
salary = salary.reset_index()

In [79]:
salary.head()

   EmpID  Salary  Increment
0    111   76804       8448
1    222   70350       8442
2    333   86907       9559
3    444   77576       7757
4    555   59766       5976

In [80]:
emp.head(2)

        Name  Age  Experience
EmpID
111     Amit   31           5
222    Jeena   31           2

In [81]:
pd.merge(emp, salary, left_index=True, right_on="EmpID")

     Name  Age  Experience  EmpID  Salary  Increment
0    Amit   31           5    111   76804       8448
1   Jeena   31           2    222   70350       8442
2    John   36           4    333   86907       9559
3   Vivek   35           9    444   77576       7757
4    Luke   40           6    555   59766       5976
5  Harris   36           1    666   55001       4950
6  Warner   32           3    777   55673       5010
7  Dravid   34           1    888   54940       5494
8   Rahul   37           8    999   78865       7886

In [82]:
city = pd.read_clipboard()

In [83]:
city.head()

   EmpID           City
0    111            Goa
1    222  New York City
2    333           Troy
3    444         Mumbai
4    555        Chennai

In [ ]:
A,B,C and D

A to B : AB
AB to C: ABC
ABC to D : ABCD

In [84]:
EmpSalary = pd.merge(emp,salary, left_index=True, right_on = "EmpID")

In [85]:
EmpSalary.head()

    Name  Age  Experience  EmpID  Salary  Increment
0   Amit   31           5    111   76804       8448
1  Jeena   31           2    222   70350       8442
2   John   36           4    333   86907       9559
3  Vivek   35           9    444   77576       7757
4   Luke   40           6    555   59766       5976

In [86]:
EmployeeDb = EmpSalary.merge(city, on = "EmpID")

In [87]:
EmployeeDb.head()

    Name  Age  Experience  EmpID  Salary  Increment           City
0   Amit   31           5    111   76804       8448            Goa
1  Jeena   31           2    222   70350       8442  New York City
2   John   36           4    333   86907       9559           Troy
3  Vivek   35           9    444   77576       7757         Mumbai
4   Luke   40           6    555   59766       5976        Chennai